pmo-dataset/variations/graphviz_with_ids/19.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "Task_1" [label="Select items"];
  "Task_2" [label="Set payment method"];
  "Task_3" [label="Select free reward"];
  "Task_4" [label="Deliver items"];
  "Task_5" [label="Pay"];
  "Task_6" [label="Login"];
  "Task_7" [label="Return items"];
  "Task_8" [label="Complete installment\nagreement"];
  "StartNoneEvent_1" [shape=circle, label="start"];
  "EndNoneEvent_1" [shape=circle, penwidth=4, label="end"];
  "ExclusiveGateway_1" [shape=diamond, label="X"];
  "ExclusiveGateway_2" [shape=diamond, label="X"];
  "ExclusiveGateway_3" [shape=diamond, label="X"];
  "ExclusiveGateway_4" [shape=diamond, label="X"];
  "ParallelGateway_1" [shape=diamond, label="+"];
  "ParallelGateway_2" [shape=diamond, label="+"];
  "ParallelGateway_3" [shape=diamond, label="+"];
  "ParallelGateway_4" [shape=diamond, label="+"];

  "ExclusiveGateway_2" -> "Task_7";
  "StartNoneEvent_1" -> "Task_6";
  "Task_3" -> "ParallelGateway_3";
  "Task_8" -> "ExclusiveGateway_1";
  "ExclusiveGateway_1" -> "ParallelGateway_3";
  "ParallelGateway_2" -> "Task_3";
  "Task_1" -> "ParallelGateway_2";
  "ParallelGateway_3" -> "ExclusiveGateway_3";
  "Task_2" -> "ParallelGateway_1";
  "ParallelGateway_4" -> "Task_1";
  "Task_7" -> "ExclusiveGateway_3";
  "ExclusiveGateway_3" -> "Task_4";
  "ExclusiveGateway_4" -> "Task_8";
  "Task_6" -> "ParallelGateway_4";
  "ParallelGateway_1" -> "ExclusiveGateway_4";
  "ExclusiveGateway_2" -> "EndNoneEvent_1";
  "Task_5" -> "ExclusiveGateway_1";
  "ParallelGateway_2" -> "ParallelGateway_1";
  "ExclusiveGateway_4" -> "Task_5";
  "Task_4" -> "ExclusiveGateway_2";
  "ParallelGateway_4" -> "Task_2";
}
